engwilluni/stm32-datalogger/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define SDCARD_D3_Pin GPIO_PIN_4
#define SDCARD_D3_GPIO_Port GPIOA
#define SDCARD_CLK_Pin GPIO_PIN_5
#define SDCARD_CLK_GPIO_Port GPIOA
#define SDCARD_D0_Pin GPIO_PIN_6
#define SDCARD_D0_GPIO_Port GPIOA
#define SDCARD_CMD_Pin GPIO_PIN_7
#define SDCARD_CMD_GPIO_Port GPIOA
#define Pot_Pin GPIO_PIN_4
#define Pot_GPIO_Port GPIOC
#define BtnSelect_Pin GPIO_PIN_11
#define BtnSelect_GPIO_Port GPIOD
#define BtnUp_Pin GPIO_PIN_12
#define BtnUp_GPIO_Port GPIOD
#define BtnRight_Pin GPIO_PIN_13
#define BtnRight_GPIO_Port GPIOD
#define BtnDown_Pin GPIO_PIN_14
#define BtnDown_GPIO_Port GPIOD
#define BtnLeft_Pin GPIO_PIN_15
#define BtnLeft_GPIO_Port GPIOD
#define BtnUser_Pin GPIO_PIN_7
#define BtnUser_GPIO_Port GPIOB
#define SDCARD_CD_Pin GPIO_PIN_0
#define SDCARD_CD_GPIO_Port GPIOE

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
